# Pandas

pandas (all lowercase) is a popular python-based data analysis toolkit which can be imported using import pandas as pd. it 
presents a diverse range of utilities,ranging from parsing multiple file formats to converting an entire data table in to a NumPy matrix array. This makes pandas a trusted ally in data science and machine learning.

In [1]:
import numpy as np
import pandas as pd

In [2]:
import warnings 
warnings.filterwarnings('ignore')

In [3]:
ser =pd.Series()

ser
#print ('{}\n'.format(ser))

Series([], dtype: float64)

In [4]:
ser = pd.Series ([0,10,20,30,40,50,60,70,80,90])
ser

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [5]:
# Notice Data type
ser = pd.Series([20,15.6,'10','a'])

In [6]:
ser

0      20
1    15.6
2      10
3       a
dtype: object

In [7]:
#creat dectionary
dict = {'A':[1,2,5], 'B':[5,8,9], 'C':[1,2,3]}
dict

{'A': [1, 2, 5], 'B': [5, 8, 9], 'C': [1, 2, 3]}

In [8]:
dict = {'A':[1,2,5], 'B':[5,8,9], 'C':[1,2,3]}
df = pd.DataFrame(dict)
df

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [9]:
#add new column and add values into it
df['D']="one two ten".split()
df

   A  B  C    D
0  1  5  1  one
1  2  8  2  two
2  5  9  3  ten

In [10]:
df['E']= [10,25,50]
df

   A  B  C    D   E
0  1  5  1  one  10
1  2  8  2  two  25
2  5  9  3  ten  50

In [11]:
# how to create NaN(Not a Number) values and its manipulation
dict ={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3],'D':[20,25,35]}
df = pd.DataFrame(dict)
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  25
2  NaN  NaN  3  35

In [12]:
print("\nDropping any column with a NaN value\n",'-'*50)
print (df.dropna(axis=1))

Dropping any column with a NaN value
 --------------------------------------------------
   C   D
0  1  20
1  2  25
2  3  35

In [13]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  25
2  NaN  NaN  3  35

In [14]:
print("\nDropping any column with a NaN value\n",'-'*50)
print (df.dropna(axis=0))

Dropping any column with a NaN value
 --------------------------------------------------
     A    B  C   D
0  1.0  5.0  1  20

In [15]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  25
2  NaN  NaN  3  35

In [16]:
print("\nDropping any column with a NaN value\n",'-'*50)
print (df.fillna(value=50))

Dropping any column with a NaN value
 --------------------------------------------------
      A     B  C   D
0   1.0   5.0  1  20
1   2.0  50.0  2  25
2  50.0  50.0  3  35

In [17]:
print("\nFilling values with a computed value(mean of column c here )\n",'-'*80,sep =' ')
df.fillna (value=df['C'].mean(),inplace=True)
print(df)

Filling values with a computed value(mean of column c here )
 --------------------------------------------------------------------------------
     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  25
2  2.0  2.0  3  35

In [18]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  25
2  2.0  2.0  3  35

In [19]:
#create dataframe 
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'PERSON':['Sam','Charlie','Ammy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Profit':[40,24,68,24,13,70]}
df = pd.DataFrame(data)
df

  Company   PERSON  Sales  Profit
0    GOOG      Sam    200      40
1    GOOG  Charlie    120      24
2    MSFT     Ammy    340      68
3    MSFT  Vanessa    124      24
4      FB     Carl    243      13
5      FB    Sarah    350      70

## Groupby

In [20]:
avg_Sales =df.groupby('Company',as_index = False)['Sales'].mean()     # as_index = False  = To print index
print(" \n Grouping by 'Company' column and listing mean sales \n",'-'*80)
print(avg_Sales)

 Grouping by 'Company' column and listing mean sales
 --------------------------------------------------------------------------------
  Company  Sales
0      FB  296.5
1    GOOG  160.0
2    MSFT  232.0

In [21]:
total_Sales = df.groupby('Company' )[['Sales','Profit']].sum()

print(" \n Groupping by 'Company' column and listing sum of sales and profit \n",'-'*50)
print(total_Sales)

 Groupping by 'Company' column and listing sum of sales and profit
 --------------------------------------------------
         Sales  Profit
Company
FB         593      83
GOOG       320      64
MSFT       464      92

In [22]:
sales_stats =df.groupby('Company')[['Sales','Profit']].agg(['mean','sum'])
print(" \n Grouping by 'Company'column and both sum and average sales \n",'-'*80)
print(sales_stats)

 Grouping by 'Company'column and both sum and average sales
 --------------------------------------------------------------------------------
         Sales      Profit
          mean  sum   mean sum
Company
FB       296.5  593   41.5  83
GOOG     160.0  320   32.0  64
MSFT     232.0  464   46.0  92

In [23]:
# Finding the largest value in each group. This proudce sales and corrosponding index
df.groupby('Company')['Sales'].nlargest(1)  # '1' is top 1.

Company
FB       5    350
GOOG     0    200
MSFT     2    340
Name: Sales, dtype: int64

In [24]:
# Finding the smallest value in each group. This proudce sales and corrosponding index
df.groupby('Company')['Sales'].nsmallest(1)  # '1' is top 1.

Company
FB       4    243
GOOG     1    120
MSFT     3    124
Name: Sales, dtype: int64

# Let's learn about

####  Concat

####   Merge

####   Join

# Concating dataframes

In [25]:
#creating data frames
Class_a = pd.DataFrame({'Maths': [45,68,35,65],
                   'English':[54,87,36,52],
                   'Science':[66,77,88,70],
                   'Chemestry':[54,79,58,76]},
                  index = ['Ravi','Shyam','Farhan','Abhi'])
Class_a

        Maths  English  Science  Chemestry
Ravi       45       54       66         54
Shyam      68       87       77         79
Farhan     35       36       88         58
Abhi       65       52       70         76

In [26]:
Class_b = pd.DataFrame({'Maths':[50,87,69,71],
                       'English':[66,50,87,69],
                       'Science':[34,66,69,71],
                       'Chemestry':[56,87,34,66]},
                      index =['Shaan','Mahira','Viru','Monica'])
Class_b

        Maths  English  Science  Chemestry
Shaan      50       66       34         56
Mahira     87       50       66         87
Viru       69       87       69         34
Monica     71       69       71         66

In [27]:
Class_c =pd.DataFrame ({'Maths':[66,50,87,56],
                       'English':[56,87,89,71],
                       'Science':[87,89,70,56],
                       'Chemestry':[34,56,56,87]},
                      index = ['Astha','Rohit','Sonia','Sheetal'])
Class_c

         Maths  English  Science  Chemestry
Astha       66       56       87         34
Rohit       50       87       89         56
Sonia       87       89       70         56
Sheetal     56       71       56         87

In [28]:
#Concatenation
all_students_marks = pd.concat([Class_a,Class_b,Class_c],axis = 0)
print('\nAfter Concatenation along row \n','-'*80,sep =' ')
print(all_students_marks)

After Concatenation along row
 --------------------------------------------------------------------------------
         Maths  English  Science  Chemestry
Ravi        45       54       66         54
Shyam       68       87       77         79
Farhan      35       36       88         58
Abhi        65       52       70         76
Shaan       50       66       34         56
Mahira      87       50       66         87
Viru        69       87       69         34
Monica      71       69       71         66
Astha       66       56       87         34
Rohit       50       87       89         56
Sonia       87       89       70         56
Sheetal     56       71       56         87

In [29]:
all_students_marks = pd.concat([Class_a,Class_b,Class_c],axis = 1)
print('\nAfter Concatenation along row \n','-'*80,sep =' ')
print(all_students_marks)

After Concatenation along row
 --------------------------------------------------------------------------------
         Maths  English  Science  Chemestry  Maths  English  Science  \
Ravi      45.0     54.0     66.0       54.0    NaN      NaN      NaN
Shyam     68.0     87.0     77.0       79.0    NaN      NaN      NaN
Farhan    35.0     36.0     88.0       58.0    NaN      NaN      NaN
Abhi      65.0     52.0     70.0       76.0    NaN      NaN      NaN
Shaan      NaN      NaN      NaN        NaN   50.0     66.0     34.0
Mahira     NaN      NaN      NaN        NaN   87.0     50.0     66.0
Viru       NaN      NaN      NaN        NaN   69.0     87.0     69.0
Monica     NaN      NaN      NaN        NaN   71.0     69.0     71.0
Astha      NaN      NaN      NaN        NaN    NaN      NaN      NaN
Rohit      NaN      NaN      NaN        NaN    NaN      NaN      NaN
Sonia      NaN      NaN      NaN        NaN    NaN      NaN      NaN
Sheetal    NaN      NaN      NaN        NaN    NaN      NaN      NaN

         Chemestry  Maths  English  Science  Chemestry
Ravi           NaN    NaN      NaN      NaN        NaN
Shyam          NaN    NaN      NaN      NaN        NaN
Farhan         NaN    NaN      NaN      NaN        NaN
Abhi           NaN    NaN      NaN      NaN        NaN
Shaan         56.0    NaN      NaN      NaN        NaN
Mahira        87.0    NaN      NaN      NaN        NaN
Viru          34.0    NaN      NaN      NaN        NaN
Monica        66.0    NaN      NaN      NaN        NaN
Astha          NaN   66.0     56.0     87.0       34.0
Rohit          NaN   50.0     87.0     89.0       56.0
Sonia          NaN   87.0     89.0     70.0       56.0
Sheetal        NaN   56.0     71.0     56.0       87.0

# Merge

In [30]:
Player_id_name =pd.DataFrame({
    'ID':[25,30,35,40,45,50,55],
    'Name': ['Ronaldo','Messi','Pele','Maradona','Harry','Pogba','Chetri']
})

print('-'*50, "\n player ID and Name \n",'-'*50)
Player_id_name

--------------------------------------------------
 player ID and Name
 --------------------------------------------------

   ID      Name
0  25   Ronaldo
1  30     Messi
2  35      Pele
3  40  Maradona
4  45     Harry
5  50     Pogba
6  55    Chetri

In [31]:
Player_details =pd.DataFrame({
    'ID':[52,30,45,50,55,],
    'Age':[36,34,28,28,37],
    'Country':['Portugal','Argentina','England','France','India']
})
Player_details

   ID  Age    Country
0  52   36   Portugal
1  30   34  Argentina
2  45   28    England
3  50   28     France
4  55   37      India

In [32]:
print(" === Datasets will be merged based on the matching ID's ===")
pd.merge(Player_id_name,Player_details,on = 'ID')

 === Datasets will be merged based on the matching ID's ===

   ID    Name  Age    Country
0  30   Messi   34  Argentina
1  45   Harry   28    England
2  50   Pogba   28     France
3  55  Chetri   37      India

# Join

In [33]:
#join operators
left =pd.DataFrame({'A':['A0','A1','A2'],
                   'B':['B0','B1','B2']},
                  index = ['K0','K1','K2'])
right = pd.DataFrame({'C':['C0','C2','C3'],
                     'D':['D0','D2','D3']},
                    index = ['K0','K2','K3'])

left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [34]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [35]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [36]:
left.join(right,how ='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

###   Apply functions

In [37]:
df = pd.DataFrame({'Dept':[1,2,3,4,5,6,7,8,9,10],
                  'Emp_name':['Rajesh','Shankar','Sindhu','Akshay','Vivan','Monica','Salman','Prateek','Roma','Rahul'],
                  'Salary':[4944,5455,6166,4044,3433,2922,6466,7977,6766,5155]})

In [38]:
df

   Dept Emp_name  Salary
0     1   Rajesh    4944
1     2  Shankar    5455
2     3   Sindhu    6166
3     4   Akshay    4044
4     5    Vivan    3433
5     6   Monica    2922
6     7   Salman    6466
7     8  Prateek    7977
8     9     Roma    6766
9    10    Rahul    5155

In [39]:
#Define a function
def salary_hike(x):
    if(x > 3000):
        return np.ceil(x+(x * .30))
    else:
        return np.ceil(x * 1.5)

In [40]:
df['New_Salary'] = df['Salary'].apply(salary_hike)
print(df)

   Dept Emp_name  Salary  New_Salary
0     1   Rajesh    4944      6428.0
1     2  Shankar    5455      7092.0
2     3   Sindhu    6166      8016.0
3     4   Akshay    4044      5258.0
4     5    Vivan    3433      4463.0
5     6   Monica    2922      4383.0
6     7   Salman    6466      8406.0
7     8  Prateek    7977     10371.0
8     9     Roma    6766      8796.0
9    10    Rahul    5155      6702.0

In [41]:
# Increased Salary
df['Increased_Salary'] = df['New_Salary']-df['Salary']
df

   Dept Emp_name  Salary  New_Salary  Increased_Salary
0     1   Rajesh    4944      6428.0            1484.0
1     2  Shankar    5455      7092.0            1637.0
2     3   Sindhu    6166      8016.0            1850.0
3     4   Akshay    4044      5258.0            1214.0
4     5    Vivan    3433      4463.0            1030.0
5     6   Monica    2922      4383.0            1461.0
6     7   Salman    6466      8406.0            1940.0
7     8  Prateek    7977     10371.0            2394.0
8     9     Roma    6766      8796.0            2030.0
9    10    Rahul    5155      6702.0            1547.0

In [43]:
print("\n Sum of the column 'New_Salary' is: " ,df['New_Salary'].sum())

 Sum of the column 'New_Salary' is:  69915.0

In [44]:
print(" Min and Max of the column 'New_Salary' are: ")
df['New_Salary'].min(),"and",df['New_Salary'].max()

 Min and Max of the column 'New_Salary' are:

(4383.0, 'and', 10371.0)

In [45]:
print(" Min and Max of the column 'New_Salary' are: ",df['New_Salary'].min(),"and",df['New_Salary'].max())

 Min and Max of the column 'New_Salary' are:  4383.0 and 10371.0

####  Deletion, sorting , list of column and row names

In [49]:
print("\n Name of columns \n",'-'*25)


print(df.columns)

 Name of columns
 -------------------------
Index(['Dept', 'Emp_name', 'Salary', 'New_Salary', 'Increased_Salary'], dtype='object')

In [50]:
l = list(df.columns)


print("\n Column names in a list of strings for later manipulation: \n", l)

 Column names in a list of strings for later manipulation:
 ['Dept', 'Emp_name', 'Salary', 'New_Salary', 'Increased_Salary']

In [51]:
print("\n Deleting columns \n ", '-'*50)

df.drop('Salary' ,axis =1 ,inplace =True)
df

 Deleting columns
  --------------------------------------------------

   Dept Emp_name  New_Salary  Increased_Salary
0     1   Rajesh      6428.0            1484.0
1     2  Shankar      7092.0            1637.0
2     3   Sindhu      8016.0            1850.0
3     4   Akshay      5258.0            1214.0
4     5    Vivan      4463.0            1030.0
5     6   Monica      4383.0            1461.0
6     7   Salman      8406.0            1940.0
7     8  Prateek     10371.0            2394.0
8     9     Roma      8796.0            2030.0
9    10    Rahul      6702.0            1547.0

**_you can also delete by command._**

In [52]:
print("\n Deleting columns by 'del' comand \n",'-'*50)
del df['Dept']
df

 Deleting columns by 'del' comand
 --------------------------------------------------

  Emp_name  New_Salary  Increased_Salary
0   Rajesh      6428.0            1484.0
1  Shankar      7092.0            1637.0
2   Sindhu      8016.0            1850.0
3   Akshay      5258.0            1214.0
4    Vivan      4463.0            1030.0
5   Monica      4383.0            1461.0
6   Salman      8406.0            1940.0
7  Prateek     10371.0            2394.0
8     Roma      8796.0            2030.0
9    Rahul      6702.0            1547.0

In [54]:
df.sort_values(by= 'New_Salary' ,ascending =False)  #ascending= True by default

  Emp_name  New_Salary  Increased_Salary
7  Prateek     10371.0            2394.0
8     Roma      8796.0            2030.0
6   Salman      8406.0            1940.0
2   Sindhu      8016.0            1850.0
1  Shankar      7092.0            1637.0
9    Rahul      6702.0            1547.0
0   Rajesh      6428.0            1484.0
3   Akshay      5258.0            1214.0
4    Vivan      4463.0            1030.0
5   Monica      4383.0            1461.0

In [55]:
df.sort_values(by= 'New_Salary')

  Emp_name  New_Salary  Increased_Salary
5   Monica      4383.0            1461.0
4    Vivan      4463.0            1030.0
3   Akshay      5258.0            1214.0
0   Rajesh      6428.0            1484.0
9    Rahul      6702.0            1547.0
1  Shankar      7092.0            1637.0
2   Sindhu      8016.0            1850.0
6   Salman      8406.0            1940.0
8     Roma      8796.0            2030.0
7  Prateek     10371.0            2394.0